### Data Cleaning and Preprocessing in Python

In [1]:
# import pandas library

import pandas as pd

In [2]:
# read datasets (from local storage) into pandas dataframe
assessment_table_df = pd.read_csv(r'C:\Users\FashinLuk\Downloads\Assessment_file\AssessmentData.csv')

#  concise summary of assessment_table_df
assessment_table_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 82 entries, 0 to 81
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ID         82 non-null     int64
 1   Name       82 non-null     object
 2   Age        73 non-null     float64
 3   Gender     82 non-null     object
 4   City       82 non-null     object
 5   Income     76 non-null     object
 6   Year       81 non-null     float64
 7   EntryDate  81 non-null     object
dtypes: float64(2), int64(1), object(5)
memory usage: 5.3+ KB

In [3]:
# check assessment_table_df dimension:

assessment_table_df.shape

(82, 8)

### Processing/Dealing with (near) Duplicates

In [4]:
#List of columns in the datasets

assessment_table_df.columns

Index(['ID', 'Name', 'Age', 'Gender', 'City', 'Income', 'Year', 'EntryDate'], dtype='object')

In [5]:
# check for duplicate rows based on a subset of columns ['Name', 'Age', 'Gender', 'City', 'Income', 'Year']

# define column subset
columns_to_check = ['Name', 'Age', 'Gender', 'City', 'Income', 'Year']

#check for duplicate rows based on the specified columns
duplicates = assessment_table_df[assessment_table_df.duplicated(columns_to_check)]

# print(duplicates)

In [6]:
# How many duplicate rows are there in the dataset (from dimension)
duplicates.shape

(21, 8)

In [7]:
# drop duplicates y keeping just the first instance of all the near duplicates
assessment_table_df = assessment_table_df.drop_duplicates(columns_to_check, keep='first')
# print(assessment_table_df)


# remaining records
assessment_table_df.shape

(61, 8)

### Processing/Dealing with Data Types

In [8]:
# convert Income data type (from object) to numeric, and coercing errors to NaN

assessment_table_df['Income'] = pd.to_numeric(assessment_table_df['Income'], errors = 'coerce')
print(assessment_table_df['Income'].dtype)

float64

In [9]:
# Check for NaN values in Income column:
nan_values = assessment_table_df[assessment_table_df['Income'].isna()]
nan_values

,ID,Name,Age,Gender,City,Income,Year,EntryDate
4,5,Alice Brown,30.0,Female,Hamilton,NaN,2021.0,2024-06-12
6,7,Michael Scott,NaN,-,London,NaN,2020.0,2024-02-14
22,23,George Brown,40.0,Male,Waterloo,NaN,2021.0,2024-05-10
27,28,Michael Scott,NaN,-,London,NaN,2022.0,2024-03-28
32,33,Alice Brown,30.0,Female,Niagara Falls,NaN,2023.0,2024-05-25
42,43,George Brown,40.0,Male,Greater Sudbury,NaN,2020.0,2024-02-25
56,57,Michael Scott,NaN,-,London,NaN,2023.0,2024-05-07
72,73,George Brown,40.0,Male,Waterloo,NaN,2020.0,2024-03-15

In [10]:
# remaining dataframe records
assessment_table_df.shape

(61, 8)

### Processing/Dealing with Inconsistent value: '-' (in Gender)

In [11]:
# Distinct values in Gender:

genderFrequency = assessment_table_df.groupby('Gender').count()
genderFrequency

        ID  Name  Age  City  Income  Year  EntryDate
Gender
-        3     3    0     3       0     3          3
Female  35    35   33    35      33    35         35
Male    23    23   23    23      20    22         22

In [12]:
# Filtering rows where Gender is either 'male' or 'female'
assessment_table_df = assessment_table_df[(assessment_table_df['Gender'].str.lower() == 'male') | (assessment_table_df['Gender'].str.lower() == 'female')]


assessment_table_df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [13]:
# remaining dataframe records
assessment_table_df.shape

(58, 8)

### Processing/Dealing with Missing Values (Age, Income, Year, EntryDate)

In [14]:
# dealing with missing value in Age column: filling with another value (e.g. mean)
mean_Age = round(assessment_table_df['Age'].mean(), 0)

assessment_table_df['Age'].fillna(mean_Age, inplace=True)

In [15]:
#Check new Age column for NaN 
# nan_values_age = assessment_table_df[assessment_table_df['Age'].isna()]
# nan_values

In [16]:
# dealing with missing value in Income column: filling with another value (e.g. median)
median_Income = assessment_table_df['Income'].median()

assessment_table_df['Income'].fillna(median_Income, inplace=True)

In [17]:
#Check new Income column for NaN 

# nan_values_Income = assessment_table_df[assessment_table_df['Income'].isna()]
# nan_values

##### Drop record(s) where year and entrydate is null

In [18]:
#drop record where year and entrydate is null

assessment_table_df.dropna(subset=['Year', 'EntryDate'], how ='all', inplace=True)

In [19]:
# Check for Null post-processing 

assessment_table_df.isnull().sum() # assessment_table_df.isna().sum()

ID           0
Name         0
Age          0
Gender       0
City         0
Income       0
Year         0
EntryDate    0
dtype: int64

In [20]:
# remaining dataframe records

assessment_table_df.shape

(57, 8)

#### Split the 'Name' column into 'Last Name' and 'First Name'

In [21]:
# Split the 'Name' column into 'Last Name' and 'First Name'
assessment_table_df[['Last Name', 'First Name']] = assessment_table_df['Name'].str.split(' ', n=1, expand=True)

# Drop the original 'Name' column
assessment_table_df = assessment_table_df.drop(columns=['Name'])

# Reorder columns to place 'Last Name' and 'First Name' after 'ID'
cols = ['ID', 'Last Name', 'First Name'] + [col for col in assessment_table_df.columns if col not in ['ID', 'Last Name', 'First Name']]
assessment_table_df = assessment_table_df[cols]

assessment_table_df.head()

,ID,Last Name,First Name,Age,Gender,City,Income,Year,EntryDate
0,1,John,Doe,28.0,Male,Toronto,5500.0,2021.0,2024-01-15
1,2,Jane,Smith,35.0,Female,Ottawa,6200.0,2020.0,2024-02-20
3,4,Bob,Johnson,35.0,Male,Mississauga,7000.0,2022.0,2024-01-25
4,5,Alice,Brown,30.0,Female,Hamilton,7000.0,2021.0,2024-06-12
5,6,Emily,Davis,45.0,Female,Brampton,8000.0,2023.0,2024-04-05

In [22]:
# Write the dataframe to an Excel file as cleaned assessment dataset
assessment_table_df.to_excel('cleaned_assessmentdatasets.xlsx', index=False)

print("Dataframe has been written to output.xlsx")

Dataframe has been written to output.xlsx